run/testCoupling/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    //transport       const;
    thermo          hPolynomial;
    //thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.9;
    }
    thermodynamics
    {
        Sf              0;
        Hf              0;
        CpCoeffs<8>     ( 1.04771399e+03 -3.51274993e-01 8.21136099e-04 -3.77730090e-07 0 0 0 0 );
        //Coefficients for cp(T) polynomial: cp = -3.77730090e-07*T**3 + 8.21136099e-04*T**2 - 3.51274993e-01*T + 1.04771399e+03
        //Reference: Eric W. Lemmon, Richard T. Jacobsen, Steven G. Penoncello, and Daniel G. Friend. Thermodynamic Properties of Air and Mixtures of Nitrogen, Argon, and Oxygen from 60 to 2000 K at Pressures to 2000 MPa. J. Phys. Chem. Ref. Data, 29(3):331–385, 2000. doi:10.1063/1.1285884.

        // Cp              1000;
    }
    transport
    {
        muCoeffs<8>     ( 3.37830161e-06 5.48760775e-08 -1.52828802e-11 0 0 0 0 0 );
        //Coefficients for mu(T) polynomial: mu = -1.52828802e-11*T**2 + 5.48760775e-08*T + 3.37830161e-06
        //Reference: E. W. Lemmon and R. T Jacobsen. Viscosity and Thermal Conductivity Equations for Nitrogen, Oxygen, Argon, and Air. Int. J. Thermophys., 25(1):21–69, 2004. doi:10.1023/B:IJOT.0000022327.04529.f3.
        kappaCoeffs<8>  ( 3.28247609e-03 8.21681514e-05 -1.81458474e-08 0 0 0 0 0 );
        //Coefficients for k(T) polynomial: k = -1.81458474e-08*T**2 + 8.21681514e-05*T + 3.28247609e-03
        //Reference: Reference: E. W. Lemmon and R. T Jacobsen. Viscosity and Thermal Conductivity Equations for Nitrogen, Oxygen, Argon, and Air. Int. J. Thermophys., 25(1):21–69, 2004. doi:10.1023/B:IJOT.0000022327.04529.f3.
    
        // mu              1.8e-05;
        // Pr              0.7;
    }
}


// ************************************************************************* //
