run/testCoupling/0.orig/phib
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      TBed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.4;

boundaryField
{
    bottom
    {
        type            zeroGradient;
        value           uniform 0.4;
    }

    top
    {
        type            zeroGradient;
        value           uniform 0.4;
    }

    walls
    {
        type            zeroGradient;
        value           uniform 0.4;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
