run/testCoupling/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 600
);

regions
(
    boxToCell
    {
//        box (4.5 -1000 4.5) (5.5 1e-5 5.5);
        box (-1e10 -1e10 -1e10) (1e10 3 1e10);
//        box (2 2 -1e10) (3 3 1e10);

        fieldValues
        (
            volScalarFieldValue T 300
        );
    }
    boxToCell
    {
        box (2.3 -1e10 -1e10) (2.7 5 1e10);

        fieldValues
        (
            volScalarFieldValue T 300
        );
    }
);


// ************************************************************************* //
